org-blog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
          "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
  <head>
    <title>MATT THOMPSON</title>
    <meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta  name="generator" content="Org-mode" />
    <link rel="stylesheet" type="text/css" href="style.css" />
  </head>
  <body>
    <div id="content">
      <h1 class="title">MATT THOMPSON</h1>
      <hr  />
      <div id="outline-container-sec-1" class="outline-2">
        <h2 id="sec-1">Blogging using just org-mode and github-pages</h2>
        <div class="outline-text-2" id="text-1">
          <p>
            <i>Wed July 22nd 2015</i>
          </p>

          <p>
            When I'm writing something, I want to just open up a window (or emacs buffer) and start writing. I don't want to have to worry about whether or not I have a net connection, or whether Jekyll/Octopress/Pelikan/whatever is synced with the git repo properly. I want to be able to blog from multiple machines without going through all the madness that Octopress etc involve.
          </p>

          <p>
            That's why I decided to migrate my blog to the simplest format possible: just plain org-mode. A single command generates the html from inside emacs. I have a simple CSS style, using default fonts. It looks nice, and loads fast. Publishing to github pages is hella easy. So now I have a dead simple, freely hosted blog/web page. Writing blog posts is now somehow less intimidating.
          </p>

          <hr  />

          <div align=center>
            <p>
              <a href="http://mthompson.org">Home</a>
            </p>
          </div>
        </div>
      </div>
    </div>
  </body>
</html>
